In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import warnings

warnings.filterwarnings("ignore")
pd.pandas.set_option("display.max_columns",None)

In [2]:
df=pd.read_csv(r"EasyVisa.csv")
print(df.shape)

(25480, 12)

DATA CLEANING (HADNLING MISSING VALUES)

In [5]:
features_with_na=[features for features in df.columns if df[features].isnull().sum()>=1]
for features in features_with_na:
    print(features,np.round(df[feature].isnull().mean()*100,5)," % missing values")
    
    
#no missing values

In [ ]:
df.duplicated().sum()  #no duplicates

np.int64(0)

In [8]:
df.drop("case_id",inplace=True,axis=1)  #dropping the case id as it is irrelevant

FEATURE ENGINEERING

In [9]:
#feature extraction

df.head()

,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified

In [13]:
#converting the year of establishment to the age of company

from datetime import date

todays_date=date.today()
current_year=todays_date.year

df['company_age']=current_year-df['yr_of_estab']
df.drop("yr_of_estab",inplace=True,axis=1)

In [ ]:
df.head()

,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status,company_age
0,Asia,High School,N,N,14513,West,592.2029,Hour,Y,Denied,19
1,Asia,Master's,Y,N,2412,Northeast,83425.6500,Year,Y,Certified,24
2,Asia,Bachelor's,N,Y,44444,West,122996.8600,Year,Y,Denied,18
3,Asia,Bachelor's,N,N,98,West,83434.0300,Year,Y,Denied,129
4,Africa,Master's,Y,N,1082,South,149907.3900,Year,Y,Certified,21

In [16]:
# numerical and categorical features

numeric_features=[feature for feature in df.columns if df[feature].dtype!="O"]
categorical_features=[feature for feature in df.columns if df[feature].dtype=="O"]

print("number of numerical features is {} : {}".format(len(numeric_features),numeric_features))
print("number of categorical features is {} : {}".format(len(categorical_features),categorical_features))

number of numerical features is 3 : ['no_of_employees', 'prevailing_wage', 'company_age']
number of categorical features is 8 : ['continent', 'education_of_employee', 'has_job_experience', 'requires_job_training', 'region_of_employment', 'unit_of_wage', 'full_time_position', 'case_status']

In [18]:
#splitting x - features and y - prediction 

y=df['case_status']
x=df.drop('case_status',axis=1)

In [22]:
# encoding the values ---> binary encoding

y.head()

0    0
1    1
2    0
3    0
4    1
Name: case_status, dtype: int64